[["id","任务名","acceptWord","gotoWord","doWord","","接受任务对话","交任务任务对话"],["id","name","acceptWord","gotoWord","doWord","deliverWord","talks","finishTalks"],[1,"回家吃饭",0,0,0,"回家吃饭去喽~~","1玫妹，我的小萝莉。我的师父喊我回家哈。||2御弟哥哥，那你先回去吧。||1嗯，想我你就看照片，勿发朋友圈，小心千里眼。||1等我忙完归来，再与你逛公园。||2讨厌，快去吧。","1师父，徒儿回来了。||2小胖呀，为师年纪大了，行动不便。||2你丫要学点本事，不要做光棍啊。||2光棍苦啊光棍乐，光棍夜晚苦水，梦中娇妻频频换，纸做嫁衣，手做妻。||1师父，我会好好努力的。我吃饭去了。||2锅里有三个馒头片，沾点孜然，将就填饱肚子吧。||1谢过师父。"],[2,"采摘草莓",0,"O(∩_∩)O哈哈，去摘草莓喽~~","我擦，草莓庄出现好多野猪，大草莓都让野猪给拱了。","野猪太可恶了，专拱粉粉的大草莓","2小胖，四月的季节，正是咱们庄里的草莓成熟的时候。||1师父，有徒儿在，草莓交由我去摘吧。||2嗯，为师要秘制几大坛草莓酱，你要多摘些。||1徒儿，这就去办。","2小胖，怎么这么少草莓？||1师父，不好了，草莓被野猪拱了。||2哪来的野猪，胆敢拱我的菜。||1一大波野猪正在草莓庄，不知从哪来的。||1徒儿尝试驱赶，反被野猪围攻，我趁机才逃出来。||2莫非蜘蛛精搞鬼？（陷入恐惧沉思中）"],[3,"通知村长",0,0,0,"报告村长，野猪袭击草莓庄啦~~","2小胖，你火速通知村长，与村长商量对策。||1嗯，好的。","1村长，不好啦。野猪袭击草莓庄啦。||2小胖，别急。细说下发生什么情况？||1咱们草莓庄，来了几头野猪，把粉红的大草莓都拱走了。||1我尝试驱赶，野猪来势凶猛，反被它围攻。||2可恶，难怪这段时间，江湖谣言四起，草莓庄将要发生大灾难。果然应验了。"],[4,"对话村长",0,0,0,0,"1村长，抄家伙，干野猪吧。不能再让野猪拱我们的草莓。||2小胖，村长我，20年前，大战女蜘蛛精，被伤到大腿了。||2这次拯救草莓庄行动，要全靠你了。快去召集莓二炮他们吧。||1村长，我定不负使命！||2慢！我给你一件武器，是我当年抗击女蜘蛛精用的，以助你一臂之力。",0],[5,"召集人马",0,0,0,0,"1二炮哥，你怎么了？||2刚才和野猪干上了。不慎被野猪击伤。||2幸好我有宝靴，趁机躲过一击，大难不死。||1那群野猪太可恶，拱我草莓，伤我人，誓不共戴天。",0],[6,"教训野猪",0,"野猪，哪里逃~~","野猪，吃俺一脚~~",0,"1二炮哥，我去教训那群猪。||2慢！我的宝靴赠予你，助你战胜野猪。||1太好了，真是好靴。","1二炮哥，那群野猪被我赶跑了。||1你的伤口严重吗？||2还好，大腿被野猪獠牙击中，疼痛剧烈，幸好没断||1我扶你回去吧。||2不用，我把随身携带的乌鸡白凤丸磨碎，混些草药，敷在伤口上就好。||2歇会儿，我自己可以回去。"],[7,"禀告村长",0,0,0,"报告村长，捡到猪牌~\\(≧▽≦)/~啦啦啦","1二炮哥，你看，刚才大战野猪时，我捡到一块猪牌。||2看来野猪来头不小，估计它还会回来的。||1我也是这么认为的，需要回去向村长禀告。","1报告村长，我与野猪大战七七四十一回合，终于把他们赶跑。||1一头野猪掉了块猪牌，让我捡到了，哈哈哈哈。||2好样的！猪牌？||1对，猪牌。上面还刻着“猪刚鬣”呢。||2猪刚鬣？快拿给我看看。||2小胖，这回我们草莓庄真的要大难临头了。||1村长，为什么这样说？“猪刚鬣”是何方恶霸，我去会会他。||2这个猪刚鬣传说是天庭玉帝手下的天蓬元帅，掌管天河十万天兵。||2因嫦娥事件，被玉帝丢到猪圈，跑到母猪肚子里变成了猪胎。||2猪刚鬣气急之下，咬杀母猪，打死猪群，好吃懒做，吃人度日。"],[8,"小月敷药",0,0,0,"也好，看望一下小月菇凉。","1村长，我去教训那头猪。||2年轻人，别冲动，目前咱们还不是他的对手，需想个良策。||2 你先去调查下，为什么猪刚鬣会来草莓庄吧。||1好的，我这就出发。||2慢，你脸上有擦伤，先去找莓小月给你敷药吧。||1多谢村长关心","2小胖哥，你来找我呀。好开心呐。||1是的，村长叫我过来找你帮我敷药。||2小胖哥，你哪里受伤了，严不严重，让我看看。||1轻伤而已，刚才打野猪被伤到。||2好心疼，是不是猪刚鬣手下那群野猪来破坏我们草莓庄？||1小月，你也知道猪刚鬣？||2江湖上流传着猪刚鬣要来草莓庄。昨天，我给莓老头熬药，莓老头说咱们草莓庄要大难临头了，猪刚鬣要破坏我们草莓庄。||1猪刚鬣，真可恶，我定要打败它。"],[9,"请教老头",0,0,0,"草莓鸡腿真好吃，O(∩_∩)O哈！","1小月，你这个线索不错，我现在就去请教莓老头。||2小胖哥，你要注意安全啊，这个草莓酱秘制的大鸡腿给你路上吃吧。||1你帮我敷药，我挺不好意思的，你留着自己吃吧。||2小胖哥，你保卫我们草莓庄，出生入死。||2你不要，人家会很生气滴。||1好吧，那多谢小月菇凉。","1老头长老，有件急事想请教您。||2请说吧。||1最近我们草莓庄被野猪袭击，幕后老板很可能是猪刚鬣。您知道猪刚鬣为什么来破坏我们草莓庄吗？||2容老衲想想。这个猪刚鬣，有可能受蜘蛛精迷惑指使。||220年前，我们草莓庄西北面来了个女蜘蛛精，偷吃了咱们祖传了1867年的秘方酿造的草莓酱。||2它便爱上了这味，每天把粉红的大草莓偷走酿制草莓酱，供其吸精修炼。||2我带领大家勇敢抗击女蜘蛛精，结果现在的村长伤到腿，而我差点丢掉性命。||2幸好路过一位道士高僧，救了我们，女蜘蛛精弃洞而逃。||1那猪刚鬣呢？||220年后，女蜘蛛精遇到猪刚鬣，见其有些本领，就和他勾搭。||2猪刚鬣被其美色迷惑，一起回到了草莓庄。||2想必我们草莓庄赖以生存的草莓要被他们拱走了。"],[10,"怒战蜘蛛",0,0,0,0,"1可恶，那咱们新帐旧账一起跟他们算。||2小胖，咱们斗不过他们的，事到如今，道士高僧下落不明，咱们还是逃吧。||1我就不信不能打败猪刚鬣，先告辞了。","1妖怪，你往哪里逃!||2你是猴子请来的救兵吗？||1劳资是莓小胖，今天特来收拾你。||1你为何三番五次破坏我们草莓庄？||2好大的口气，让你尝尝老娘的厉害。"],[11,"重伤返回",0,0,0,0,"1玫妹，我来看你了。||2啊？御弟哥哥，你怎么了？||1刚才与蜘蛛精大战，被咬一口了，现在浑身剧痛。||2御弟哥哥，你中毒了，这可怎么办好呢？||1没事，我顶得住。||2我送你回家找你师父吧。||1不用，我自己回去。","2小胖，你脸色发紫，莫非中了蜘蛛精的七窍精毒？||1师父，正是。现在浑身剧痛。||2传说中了这个毒，一天，脸色发紫；二天，七窍生烟；三天，精尽人亡。||1师父救救我啊。||2小胖，你要两天之内，快去西牛贺洲找到菩提师祖救你。||1$%#&*&%$#&^%||2$%#&*&%$#&^%||1我现在就启程。"],[12,"告别玫妹",0,0,0,0,"1玫妹，我中了七窍精毒，要去西牛贺洲找菩提师祖，不能陪你逛公园了。||2御弟哥哥，你去西牛贺洲吧，我会自己照顾自己的。||1想我，你就看照片，勿发朋友圈，等我回来与你逛公园。","1请问您是西牛贺洲的菩提师祖吗？||2我是前知五百年、后知五百载，仰知天文、俯察地理，中晓人和明阴阳。。。||1大师，您是菩提师祖吗？||2我是前知五百年后知五百载，仰知天文、俯察地理。。。||1大师，这个刚才您说过了。||2我再重新说一遍，加深一下印象。||2我是前知五百年、后知五百载，仰知天文、俯察地理，||2中晓人和、明阴阳、懂八卦，||2晓奇门、知遁甲，运筹帷幄之中，决胜千里之外的菩提师祖。"],[13,"拜师师祖",0,0,0,0,"1师祖，救救我吧，我中了女蜘蛛精的七窍精毒。||2今天算你运气好，我心情超爽，就解救你一命。||2你前去院子里摘些四叶花，加点蒜片，拌点姜丝，捏成丸，然后用菩佛道井水灌进肚子。||2一个时辰零点八分后，七窍精毒便在你体内强撸灰灰湮灭。||1多谢师祖救命之恩。","1谢谢师祖帮我解毒。请收我为徒吧。||2蒽，上天的意旨，我就收你为徒吧，给你取个法号：悟空。||1师父，请受悟空一拜。||2嗯，你先去休息吧，明早我教你些本事。"],[14,"学习技能",0,0,0,0,"2悟空，怎么起来这么晚了？||1弟子昨晚玩《空空西游》手游，忘记时辰了，请师父恕罪。||2嗯，下不为例。你想在我这里学什么？想学游戏开发吗？||1师父，学游戏开发能干什么？||2所谓游戏开发就是人前显贵，熬夜遭罪。||2日出而息日落而作，两个黑眼圈，一把心酸泪呀。||1求师父赐教。||2撸代码，抠美术，憋策划，熬创意。||2没渠道，没用户。||2你连shi都吃不上啊。||1为了打败蜘蛛精，再苦也得拼呐，能提高战斗力吗？||2不能。||1不学，不学。||2好吧，我教你技能，提高你战斗力二十个百分点。||1多谢师父。",0],[15,"调查山狼",0,0,0,0,"1师父，听说西牛竹林那一带常有山狼出没，弟子学的技能可以派上用场。||2甚好，赶出西牛贺洲就好，切记不可杀生。||1好的，弟子先去调查。","1妹子，你知道这一带哪里有山狼出没？||2就在那边，那里的山狼可凶了。\n前几天把我的兔子叼走了，吓死小女子了。||1妹子，别怕，有我在，我会保护你的。||2帅锅，那里很多山狼，你会寡不敌众的。||1妹子啊，虽然我是靠脸吃饭滴，但为了捉妖，||1我熟读金瓶梅，儿歌三百首，谈古论今，拳击舞剑，样样精通。||1可以说是能武能文，坐下一起聊会天帮你压压惊吧。||2帅锅，真会说话。小女子，尚未婚嫁还单着呢。"],[16,"驱赶山狼",0,0,0,0,"1妹子，我今天把它们驱逐出西牛竹林。等我好消息啊。||2帅锅，你若办到，小女子敬你草梅酒一杯。","1哈哈，我不费力气把狼群赶走了。||2哥哥，你可真是个男人啊，喝了这杯酒吧。||1你这里面没下春药吧。||2没有。||1想骗我。。。木门。||2见面不喝酒，不是好朋友。||1靠酒来搭桥，必定交情薄。||2感情深不深，喝酒才见人心。||1没有真感情，喝多少也不行。||2喝酒不听劝，不是男子汉。||1一劝就端碗，肯定缺心眼儿。||2你哪怕舔一口，这面子总要有。||1面子我不管，反正，我不舔。||1先告辞了，我师父喊我回家吃饭。"],[17,"星夜返回",0,0,0,0,"1师父，弟子回来了。山狼已被我赶出西牛竹林了。||2干得好。你的衣服破了，是被山狼扯破的吧。||2你为西牛贺洲办了件好事，我再赐你锻造装备之术。||1太好了，又可以提高战斗力。多谢师父。",0],[18,"学成出师",0,0,0,0,"2悟空，你学有所成，是时候下山回去拯救草莓庄了。||1师父，您救了我，传授我本领，我还没有报答您，怎能回去呢？||2报答就不必了，只要你多做善事，为民除害，我就欣慰了。||2去吧，如果以后赚到钱，别忘了请为师，出去嗨皮嗨皮。||1师父，先救济我一点生活费吧。||2哪凉快哪呆着去。||2切记，倘若他日你混砸了，||2就说特么蓝翔毕业的。||1师父受弟子一拜，告辞了。","1玫妹，我回来了。O(∩_∩)O哈哈~||2御弟哥哥，你终于回来了，太好了。||2你现在康复了吗？||1康复了。菩提祖师帮我解了毒，我拜他为师，现在我学成归来拯救草莓庄。||1现在草莓庄情况怎样？||2草莓庄已被猪刚鬣他们破坏得寸草不生，庄民逃的逃，躲的躲。||1可恶，明天我去打败那头猪。||1玫妹，这些年让你受苦了，等我打败那头猪，||1种草莓挣到钱，一定给你买个大房子。||2御弟哥哥，我看好你喔。无论将来干什么，我都会支持你。||1有你陪着我，我感到很幸福。||2等你变成土豪，肯定会遇到很多的美女。||2到时候，你就会不会鬼混呢。||1我是好男人，顶多看个片，绝不是鬼混。"],[19,"大战八戒",0,0,0,0,"1师傅，我回来了。||2小胖，你回来没饭吃了。咱们家好几天揭不开锅了。||1师傅没事，今晚咱们吃烤猪，我这就去打败那头猪。","1猪刚鬣，你快出来。||2老猪在此，识相的话就快离开这里。||1好你头猪，破坏我们草莓庄寸草不生，看我怎么收你。||2呵呵，你敢跟我比猜谜语吗？||1你说呀||2远看灯笼大||1近看大灯笼||2走近留神看||1灯笼净窟窿||2你猜是神马？||1破灯笼||2再猜一个||1你来呀||2远看像头驴||1近看像头驴||2是驴到是驴||1就是不能骑||2你猜啊！||1死驴||2算你厉害了，答出我花了半辈子猜出来的谜语||1不跟你啰嗦了，看招。"],[20,"审问八戒",0,0,0,0,"2大哥饶命啊。我迫不得已才拱你们草莓。以后真的不敢了。||1那你说说为什么迫不得已。||2我老猪当年娶了卵二姐做老婆，后来她死了，把福陵山的云栈洞遗留给我。||2玉帝老儿到处拆和尚庙，修道士院，大发香火钱，把老猪的洞也拆了。||2我无处可去，只好投奔蜘蛛精了。她天天逼我给她摘草莓。||2现在我再也不敢了。||1饶你命可以，但你要赔偿我们的损失。||2我有一笔大生意，可以介绍给你，保你发财买大房子。||1快说。||2我离开福陵山后，一天遇到观音和木吒，我拦住他们的去路，与木吒大战一场。||2不料被观音菩萨的莲花收服，我哭诉无生路。她叫我加入佛门，法号八戒，去西天取经书到东土贩卖。||2可我一个人，哪敢在玉帝脚下卖经书。||2你武艺高强，咱们可以去西天取经，到东土贩卖，抢玉帝的香火生意。||1嗯，容我想想。。。","我是观音菩萨，告诉你一个不好消息，游戏作者，因粮草断绝，倒在黑夜中，没有力气再写下去了。我代表他向你致歉。非常感谢您的支持。QQ群:277615647"]]